data/google/gke/gpu/16/node-1/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     10493.34
    fsyncs/s:                     13442.47

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               163.96

General statistics:
    total time:                          10.0045s
    total number of events:              239382

Latency (ms):
         min:                                    0.01
         avg:                                    0.04
         max:                                   23.82
         95th percentile:                        0.04
         sum:                                 9940.94

Threads fairness:
    events (avg/stddev):           239382.0000/0.00
    execution time (avg/stddev):   9.9409/0.00